# HANDLE MISSING DATA SECTION IN DATA FUNNEL

In [1]:
pip install pandas

Requirement already satisfied: pandas in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from pandas) (2.2.1)
Requirement already satisfied: python-dateutil>=2.8.2 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 24.3.1 -> 25.2
[notice] To update, run: pip3 install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [5]:
data={
    "name": ["Alice", "Bob", "Charlie", "David", "Eva", "Frank"],
    "age": [24, None, 22, None, 28, 30],
    "Salary": [50000, 60000, None, 55000, None, 70000],
}

import pandas as pd
df = pd.DataFrame(data)
df

      name   age   Salary
0    Alice  24.0  50000.0
1      Bob   NaN  60000.0
2  Charlie  22.0      NaN
3    David   NaN  55000.0
4      Eva  28.0      NaN
5    Frank  30.0  70000.0

In [11]:
df.isnull().sum()
df.isnull().mean()*100 # percentage of missing data in each column

name      0.0
age       0.0
Salary    0.0
dtype: float64

In [7]:
df.dropna()

    name   age   Salary
0  Alice  24.0  50000.0
5  Frank  30.0  70000.0

# NOW FILLING MISSING VALUES WITH AVERAGE

In [10]:
df["age"].fillna(df["age"].mean(), inplace=True)
df["Salary"].fillna(df["Salary"].mean(), inplace=True)
df

/var/folders/0m/9ryl85kj0pjd3_n15skhfrzw0000gn/T/ipykernel_81679/965399281.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["age"].fillna(df["age"].mean(), inplace=True)
/var/folders/0m/9ryl85kj0pjd3_n15skhfrzw0000gn/T/ipykernel_81679/965399281.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Salary"].fillna(df["Salary"].mean(), inplace=True)

      name   age   Salary
0    Alice  24.0  50000.0
1      Bob  26.0  60000.0
2  Charlie  22.0  58750.0
3    David  26.0  55000.0
4      Eva  28.0  58750.0
5    Frank  30.0  70000.0